TestSber/src/Documents/УстановкаЦенТарифовОпераций/УстановкаЦенТарифовОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенТарифовОпераций</name>
  <registerRecords>InformationRegister.ЦеныТарифовОпераций</registerRecords>
  <attributes>
    <name>ЦенаДняХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаМГТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаКГТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаШины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТарифОбработкиДляХаба</name>
    <attributes>
      <name>КоличествоОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestSber/src/InformationRegisters/ЦеныТарифовОпераций/ЦеныТарифовОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныТарифовОпераций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОпераций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипГрузовогоМеста</name>
    <type>
      <types>EnumRef.ТипыГрузовыхМест</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestSber/src/Enums/ВидыОпераций/ВидыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОпераций</name>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
</mdclass:Enum>

TestSber/src/Enums/ТипыГрузовыхМест/ТипыГрузовыхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыГрузовыхМест</name>
  <enumValues>
    <name>Хаб</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>КГТ</name>
  </enumValues>
  <enumValues>
    <name>МГТ</name>
  </enumValues>
</mdclass:Enum>

TestSber/src/Documents/УстановкаЦенТарифовОпераций/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЦеныТарифовОпераций
	Движения.ЦеныТарифовОпераций.Записывать = Истина;
	Для Каждого ТекСтрокаТарифОбработкиДляХаба из ТарифОбработкиДляХаба Цикл
		Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.Хаб;
		Движение.Период = Дата;
		Движение.Цена = ТекСтрокаТарифОбработкиДляХаба.Цена;
		Движение.КоличествоОт = ТекСтрокаТарифОбработкиДляХаба.КоличествоОт;
		Движение.КоличествоДо = ТекСтрокаТарифОбработкиДляХаба.КоличествоДо;
	КонецЦикла;
    
    Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Хранение;
		Движение.Период = Дата;
		Движение.Цена = ЦенаДняХранения;
	
	Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.МГТ;
		Движение.Период = Дата;
		Движение.Цена = ЦенаМГТ;

	Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.КГТ;
		Движение.Период = Дата;
		Движение.Цена = ЦенаКГТ;
		
	Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.Шины;
		Движение.Период = Дата;
		Движение.Цена = ЦенаШины;
	
КонецПроцедуры
#КонецОбласти
